A=[1 -1 0 0 0;-1 0 1 0 0;1 0 0 0 -1;0 1 0 0 -1;0 -1 1 0 0;0 0 -1 1 0;0 0 0 -1 1 ]
P=blkdiag(0.0102,0.0467,0.0126,0.0412,0.0224,0.0236,0.0146)
l1=[6;0;-9.2;0;0;0;32.9]
N=A'*P*A
W1=A'*P*l1
N1=N*pinv(N*N)
x11=N1*A'*P*l1                                                                %求最小范数解
x01=[-8.9382;0;-13.1412;-3.1535;15.9358]
x1=x01+x11 *0.001                                                            %高程平差值
v1=A*x11-l1                                                                   %精度评定
Q=pinv(N)
r=7-4
F1=sqrt((v1'*P*v1)/r)                                                       %求单位权中误差
 
l2=[57.2;0;-6.6;0;0;0;-17.3]
W2=A'*P*l2
N2=N*pinv(N*N)
x21=N1*A'*P*l2
x02=[-8.9466;0;-13.1504;-3.1618;15.8943]
x2=x02+x21*0.001
v2=A*x21-l2
Q=pinv(N)
F2=sqrt((v2'*P*v2)/r)
 
q1=Q(1,1)
t1=2/(sqrt(F1^2*q1+F2^2*q1))
q2=Q(2,2)
t2=12.8/(sqrt(F1^2*q2+F2^2*q2))
q3=Q(3,3)
t3=4.9/(sqrt(F1^2*q3+F2^2*q3))
q4=Q(4,4)
t4=-8.1/(sqrt(F1^2*q4+F2^2*q4))
q5=Q(5,5)
t5=55.8/(sqrt(F1^2*q5+F2^2*q5))
t=[t1 t2 t3 t4 t5]'                                                          %用T检验法检测是否稳定
 
A1=A(:,5)
a=[1 2 3 4]
A2=A(:,a)
N11=A1'*P*A1                                                                  %拟稳平差原理
N12=A1'*P*A2
N21=A2'*P*A1
N22=A2'*P*A2
M=N22-N21*pinv(N11)*N12
C=A2'-N21*pinv(N11)*A1'
Mm=M*pinv(M*M)
C1=Mm*C
C2=pinv(N11)*(A1'-N12*C1)
X12=C1*P*l1                                                                   %计算位置参数
X11=C2*P*l1
X01=[X12;X11]
V1=A*X01-l1                                                                   %观测值改正数
 
X22=C1*P*l2
X21=C2*P*l2
X02=[X22;X21]
V2=A*X02-l2
 
 
Q1=[C2*C2' C2*C1';C1*C2' C1*C1']                                           %未知参数协因数矩阵
